app/controllers/lists_controller.rb

    def new
       user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        List.create(list_params)
---
INSERT INTO "lists" ("title", "user_id") VALUES ($1, $2) RETURNING "id"  [["title", "For Work"], ["user_id", 1]]

    def destroy
    unless List.find_by(id: params[:id])
         redirect_to user_path(params[:user_id])
         flash[:error] = "List not Found"
    end
    List.destroy(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]

    def edit
    @list=List.find_by(id: params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
    @list=List.find_by(id: params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]