app/controllers/pages_controller.rb

    def sign_in
       @user = User.find_by(login: params[:login],password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."login" = ? AND "users"."password" = ? LIMIT ?  [["login", "wgpwrjg"], ["password", "wprgjp"], ["LIMIT", 1]]