app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

      unless @task.save
---
INSERT INTO "tasks" ("content", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Call to John"], ["list_id", 2], ["created_at", 2017-02-25 19:29:30 UTC], ["updated_at", 2017-02-25 19:29:30 UTC]]

  def update
    @task=Task.find_by(id: params[:id])
    unless @task
    redirect_to user_path(params[:user_id])
    end
    @task.update(content: params[:task] [:content])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "content" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["content", "Call to John !!!!!!!!"], ["updated_at", 2017-02-28 11:56:48 UTC], ["id", 6]]

  def destroy
    unless @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]