app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" IN (2, 4)
---
    def show
    if session[:current_user_id] == params[:id]
        @user=User.find(params[:id])
        @lists=@user.lists.includes(:tasks)

INSERT INTO "users" ("login", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["login", "Oleg"], ["password", "qqq"], ["created_at", 2017-02-23 18:13:47 UTC], ["updated_at", 2017-02-23 18:13:47 UTC]]
---
    def create
        @user=User.new(user_params)
     if @user.save